{
  "general" : {
    "title" : "Introduction",
    "text": "The phantom limb syndrome is the feeling of abnormal persistence of a limb after its amputation or after it has become insensitive due to stroke. This syndrome is often accompanied by pain sensations known as phantom pain. 68% of amputated patients suffer from phantom pain.",
    "text2": "The mirror treatment is one of the most used treatments for the phantom pain. The IMPACT (Immersive Mirror for Pain Control and Treatment) plans to use new technologies and, in particular, Augmented Reality (AR) to increase the immersion of the user and, hopefully, the efficacy of the mirror treatment. The main goal of the project is to study, conceive and develop a platform for mirror treatment of phantom pain based on Augmented Reality that will be used for clinical trials by a team of occupational therapists at CHUV.",
    "text3": "The project will use only off-the-shelf, low-cost technologies aiming to allow future home care treatment. The system will be designed for the treatment of phantom pain in lower and upper limb amputees."
  },
    "features": [
    {
      "title": "Mirror treatment",
      "image": "assets/mirror_treatment.png",
      "text": "During the mirror treatment, the patient places the stump behind a mirror and the healthy limb (arm or leg) in front of it. During the exercises, the patient needs to focus on the reflection of the healthy limb in the mirror. He needs to imagine that the reflection is the actual (missing) limb. The brain is tricked to perceive that the limb is still present and is able to manipulate it (source of the picture: ",
      "link": "https://goo.gl/5z27r1"
    },
    {
      "title": "Augmented reality and tracking",
      "link": "",
      "container": {
        "previous": {
          "btn": "Previous",
          "image": "assets/augmented_reality_and_tracking.png",
          "text": "Most of existing works are based on Virtual Reality (VR) approaches while only a minor number exploited Augmented Reality (AR). However, some studies showed that AR-based approaches demonstrated to be more effective. This is probably because AR maintains a strong component of the environment facilitating the acceptance of virtual objects (especially the virtual limb) as part of the reality. This advantage relies on the fundamental task of keeping the real and the virtual worlds constantly and perfectly overlapped. This task represents one of the greatest challenges in AR. The IMPACT project aims to achieve immersive AR by providing a reliable and accurate tracking of the patient’s body, focusing on the healthy limb to mirror, as well as the head orientation and position. An additional constraint for the system is the exclusive use of off-the-shelf, low-cost technologies. We did this choice in order to push the development towards a system that could be used in the future for home care treatment."
        },
        "next": {
          "btn": "Next",
          "image": "assets/older_prototype.png",
          "text": "Exercise in AR: The development of the exercises will be gradual. Initially, it will be limited to the animation of the virtual limb mirroring the movements of the present limb. This is the most important exercise to achieve and it represents the minimum requirement to provide a system as powerful as the optical mirror but more immersive. Moreover, it will be quite easy to integrate also “parallel” movements (not mirrored) expanding the basic possibilities of treatment. In a second step, we will start to exploit the possibilities given by Augmented Reality to make the treatment more engaging. In fact, exercises more interactive and engaging could increase the acceptance of the treatment in a moment of particular fragility for the patients. Using AR, we will realize exercises useful for the treatment but impossible with optical mirror such as interacting with a virtual object with both virtual and actual limb."
        }
      }
    },
    {
      "title": "Older prototype",
      "text": "The IMPACT project follows the results of our previous project called ",
      "text2": "PLUPART achieved good results considering the technology available at that time. However, the fast advancement of tracking technologies and VR/AR Head-mounted display allows new possibilities just impossible few years ago. The limited field of view, the limited accuracy of the tracking and the usability problems of the PLUPART prototype are just few of the many aspects that the IMPACT project aims to address.",
      "link": "https://project.eia-fr.ch/plupart"
    }
  ],

  "results": [
    {
      "title": "System Architecture",
      "image": "assets/system_architecture.png",
      "text": "The system architecture has been conceived and developed around two types of users: the therapist and the patient. On the left side, you can see all the modules that allow the management of a therapy session to the therapist (e.g., managing the users, managing the exercises, etc.). On the right side of the architecture, you can see all the modules that are dedicated to detect data from the patient (e.g., the tracking modules) and the modules that provide a feedback to the patient (in Augmented or Virtual Reality). Finally, in the center of the architecture, the Mixed Reality Engine has the role of merging in real-time these two worlds.",
      "text2": "A paper describing the full system has been submitted to the international conference",
      "link": "http://www.salentoavr.it"
    },
    {
      "title": "Serious Game",
      "image": "assets/serious_game.png",
      "text": "We developed three serious games: the “Shadow game”, the “Penalty game”, the “Music game”. The three games can be played in VR or AR according to the preferences of the therapist and/or the patient.",
      "text2": "The Shadow game is the most basic of the three but is very flexible. A 3D shadow surrounds the patient’s body. As a demonstration, the shadow shows a pre-recorded movement a first time. After a countdown, it repeats the movement and the patient has to perform the same movement at the same time. The more the patient’s movement matches the movement of the shadow, the more points she/he gets. This game can be used to perform mirrored movements (i.e., similarly to the optical mirror), parallel movements (i.e., the left and right limbs move simultaneously in the same direction) or movements that involve just the healthy limb. The system easily allows recording new movements with the Perception Neuron and adding them to the Exercises database.",
      "text3": "The Penalty game focuses on exercises for bilateral manipulation of objects. The patient needs to perform a symmetrical movement to push two buttons and summon a ball. Then, she/he has to shoot it in the football goal. Advancing with the game, the football goal becomes smaller and smaller and changes position requiring an increasing accuracy to score points.",
      "text4": "The Music game focuses on exercises for bilateral analytical movements. It is inspired by the well-known game “Guitar Hero”. During the game, couples of virtual objects move towards the patient at different height and distances. The speed and numbers of these objects depend on the tempo of the music and the chosen level of difficulty while their shapes and colors indicate the limb or joint that the patient has to use to hit them (e.g., we used golden spheres for the feet and blue cubes for the knees). At the end of the session, the game provides a score to the user.",
      "link": ""
    },
    {
      "title": "Therapist Interface",
      "image": "assets/therapist_interface.png",
      "text": "The therapist UI has the role of helping the therapist to manage the session treatment by saving and loading the patient data, launching the exercises and monitoring the scores. The figure above shows the calibration interface. On the left, six sliders allow to modify in real-time the position and the orientation of the virtual limb. These sliders are useful to fine-tune the position of the avatar when the automatic calibration is not very accurate. The nob of the slider indicates the current value as a reference.",
      "text2": "On the top, it is possible to select and change the modality of the tracking (i.e., which part of the body is tracked, whether the movement of the virtual limb are showed mirrored, etc.) and the visual aspects of the virtual limb (skin color, length and thickness). The “calibrate PoV” button allows to recalibrate the head position compared to the real world, in the case that the therapist notices that the automatic calibration was incorrect (this could happen if, for some reasons, the detection of the patient’ body was incorrect during the prior calibration).",
      "text3": "The window that occupies the majority of the page (middle-bottom-right) shows in real-time the point of view of the patient. It is thanks to this information that the therapist can adjust the parameters of the simulation.",
      "link": ""
    },

    {
      "title": "Music Game - demo",
      "text": "Video demonstration of the Music game in Virtual and Augmented Reality. NB: The prototype showed in this video is using only Kinect for the tracking of the legs (for this reason, you can see weird rotations of the ankles when the knee is fully extended). Additional videos using also Perception Neuron are available in our",
      "text2": "A paper describing the Music game will be published soon in the proceedings of the international conference",
      "link": "https://www.youtube.com/channel/UCXsw3kmBnyOY2NBGejIaAEA",
      "link2": "https://gsgs.ch"
    }
    ],
  "team": [
    {
      "name": "Francesco Carrino",
      "image": "assets/francesco.png",
      "text": "Francesco Carrino is a Researcher and Scientific Collaborator at the University of Applied Sciences and Arts of Western Switzerland, Fribourg (HES-SO FR). He is member of the HumanTech Research Institute in which he co-lead the iHealth group. He holds an MSc in Computer Science Engineering from the University of Florence, Italy. His research domains are in the area of computer science: Gestural Interaction, Multimodal Interaction, IoT, and Processing of Psycho-Physiological Signals."
    },
    {
      "name": "Omar Abou Khaled",
      "image": "assets/omar.png",
      "text": "Omar Abou Khaled is Professor in computer science at HES-SO campus Fribourg (HEIA-FR). He holds a PhD in Computer Science received from the Perception and Automatic Control Group of HEUDIASYC Laboratory of \"Université de Technologie de Compiègne\", and a Master in Computer Science from the same university. Since 1996 he has been working as research assistant in the MEDIA group of the Theoretical Computer Science Laboratory of EPFL (Ecole Polytechnique Fédérale de Lausanne) in the field of Educational Technologies and Web Based Training research field on MEDIT and CLASSROOM 2000 ( second link) projects. He holds a Master in Computer Engineering (1991). He was International Advisor at HES-SO until august 2014. He was Head of Internationale Relations Office at EIA-FR. Head of MRU \"Advanced IT Systems Architects\" at HEIA-FR. Until 2007 He was leader of the MISG (Multimedia Information System Group). He is responsible of several projects in the field of Document Engineering, Multimodal Interfaces, Context Awareness, Ambient Intelligence, Blended Learning, and Content-Based Multimedia Retrieval. He is involved in the teaching of several courses related to Information Systems, Web Technologies & Multimodal Interfaces."
    },
    {
      "name": "Elena Mugellini",
      "image": "assets/elena.png",
      "text": "Elena Mugellini is Professor in Computer Sciences at the University of Applied Sciences and Arts of Western Switzerland, Fribourg (HES-SO). She is the head of HumanTech Institute, which aims at improving the quality of life and well-being of human beings thanks to the ingenious use of new technologies. Elena holds a Bsc and Msc in Telecommunications Engineering and a Ph.D. in Computer Sciences. Her research expertise lies in intelligent environments, internet of things and human computer interaction as well as information management and intelligent data analysis techniques."
    },
    {
      "name": "Vincent Brodard",
      "image": "assets/vincent.png",
      "text": "Vincent Brodard is a student in computer engineering at the University of Applied Sciences and Arts of Western Switzerland, Fribourg (HES-SO). He holds a Maturité Certificate and he is pursuing his Bachelor studies. He is currently working on a re-educative system for amputees in the IMPACT project in order to create intuitive interfaces for therapists and improve the dynamics of generated body parts in virtual and augmented reality."
    },
    {
      "name": "Quentin Seydoux",
      "image": "assets/quentin.png",
      "text": "Quentin Seydoux is a student in Computer Sciences at the University of Applied Sciences and Arts of Western Switzerland, Fribourg (HES-SO) where he aims to do his Bachelor studies after the HES gateway he is pursuing. He is currently working on the IMPACT project as a trainee. He contributes to develop the user interface and the tracking and animation system in order to help disabled people to have physiotherapy and to re-educate their missing limb using virtual and augmented reality."
    }
  ],
  "partners":[
    {
      "name": "Marie-Laure Kaiser",
      "image": "assets/kaiser.png",
      "text": "Ergothérapeute cheffe du CHUV."
    },
    {
      "name": "Patrick Kabasu Bakajika",
      "image": "assets/patrick.png",
      "text": "Ergothérapeute chef d'unité du DAL. Praticien formateur. Ergothérapeute chef d'unité du DAL Praticien formateur. Département de l'appareil locomoteur. Hôpital Orthopédique - CHUV"
    }
  ],
  "contact":[
    {
      "name": "Francesco Carrino",
      "addresses": {"institute": "HumanTech Institute Ecole d’Ingénieurs et d’Architectes",
                    "street": "Bd de Pérolles 80",
                    "city": "1700 Fribourg",
                    "mail": "francesco.carrino@hefr.ch"},
      "link": "http://humantech.institute/",
      "image": "assets/humantech.png"
    }
  ],
  "acknowledgement":
    {
      "title": "Acknowledgement",
      "text": "This project is supported by",
      "link": "https://www.haslerstiftung.ch/index.php/en/",
      "image": "assets/hasler.png"
    }
}
