{
  "general" : {
    "title" : "Introduction",
    "introduction": "The phantom limb syndrome is the feeling of abnormal persistence of a limb after its amputation or after it has become insensitive due to stroke. This syndrome is often accompanied by pain sensations known as phantom pain. 68% of amputated patients suffer from phantom pain. The mirror treatment is one of the most used treatments for the phantom pain. The IMPACT (Immersive Mirror for Pain Control and Treatment) plans to use new technologies and, in particular, Augmented Reality (AR) to increase the immersion of the user and, hopefully, the efficacy of the mirror treatment. The main goal of the project is to study, conceive and develop a platform for mirror treatment of phantom pain based on Augmented Reality that will be used for clinical trials by a team of occupational therapists at CHUV. The project will use only off-the-shelf, low-cost technologies aiming to allow future home care treatment. The system will be designed for the treatment of phantom pain in lower and upper limb amputees."
  },
    "features": [
    {
      "title": "Mirror treatment",
      "image": "assets/mirror_treatment.png",
      "text": "During the mirror treatment, the patient places the stump behind a mirror and the healthy limb (arm or leg) in front of it. During the exercises, the patient needs to focus on the reflection of the healthy limb in the mirror. He needs to imagine that the reflection is the actual (missing) limb. The brain is tricked to perceive that the limb is still present and is able to manipulate it (source of the picture: https://goo.gl/5z27r1)."
    },
    {
      "title": "Augmented reality and tracking",
      "image": "assets/augmented_reality_and_tracking.png",
      "text": "The developed balancing system relies on the current state of the bike network and on the predictions generated by our algorithms. Upon request, the system is able to provide optimal routes and operations for the teams that perform the rebalancing operations; these operations will ensure a sufficient number of bikes in each station of the network to fulfill the future demand."
    },
    {
      "title": "Older prototype",
      "text": "The IMPACT project follows the results of our previous project called PLUPART. PLUPART achieved good results considering the technology available at that time. However, the fast advancement of tracking technologies and VR/AR Head-mounted display allows new possibilities just impossible few years ago. The limited field of view, the limited accuracy of the tracking and the usability problems of the PLUPART prototype are just few of the many aspects that the IMPACT project aims to address."
    }

  ],
  "other":
    {
      "othertitle": "Older prototype",
      "otherimage": "https://www.youtube.com/watch?v=WMuO2mLgJzY",
      "othertext": "The IMPACT project follows the results of our previous project called PLUPART. PLUPART achieved good results considering the technology available at that time. However, the fast advancement of tracking technologies and VR/AR Head-mounted display allows new possibilities just impossible few years ago. The limited field of view, the limited accuracy of the tracking and the usability problems of the PLUPART prototype are just few of the many aspects that the IMPACT project aims to address."
    },
  "team": [
    {
      "name": "Francesco Carrino",
      "image": "assets/francesco.png",
      "text": "Francesco Carrino is a Researcher and Scientific Collaborator at the University of Applied Sciences and Arts of Western Switzerland, Fribourg (HES-SO FR). He is member of the HumanTech Research Institute in which he co-lead the iHealth group. He holds an MSc in Computer Science Engineering from the University of Florence, Italy. His research domains are in the area of computer science: Gestural Interaction, Multimodal Interaction, IoT, and Processing of Psycho-Physiological Signals."
    },
    {
      "name": "Omar Abou Khaled",
      "image": "assets/omar.png",
      "text": "Omar Abou Khaled is Professor in computer science at HES-SO campus Fribourg (HEIA-FR). He holds a PhD in Computer Science received from the Perception and Automatic Control Group of HEUDIASYC Laboratory of \"Université de Technologie de Compiègne\", and a Master in Computer Science from the same university. Since 1996 he has been working as research assistant in the MEDIA group of the Theoretical Computer Science Laboratory of EPFL (Ecole Polytechnique Fédérale de Lausanne) in the field of Educational Technologies and Web Based Training research field on MEDIT and CLASSROOM 2000 ( second link) projects. He holds a Master in Computer Engineering (1991). He was International Advisor at HES-SO until august 2014. He was Head of Internationale Relations Office at EIA-FR. Head of MRU \"Advanced IT Systems Architects\" at HEIA-FR. Until 2007 He was leader of the MISG (Multimedia Information System Group). He is responsible of several projects in the field of Document Engineering, Multimodal Interfaces, Context Awareness, Ambient Intelligence, Blended Learning, and Content-Based Multimedia Retrieval. He is involved in the teaching of several courses related to Information Systems, Web Technologies & Multimodal Interfaces."
    },
    {
      "name": "Elena Mugellini",
      "image": "assets/elena.png",
      "text": "Elena Mugellini is Professor in Computer Sciences at the University of Applied Sciences and Arts of Western Switzerland, Fribourg (HES-SO). She is the head of HumanTech Institute, which aims at improving the quality of life and well-being of human beings thanks to the ingenious use of new technologies. Elena holds a Bsc and Msc in Telecommunications Engineering and a Ph.D. in Computer Sciences. Her research expertise lies in intelligent environments, internet of things and human computer interaction as well as information management and intelligent data analysis techniques."
    },
    {
      "name": "Vincent Brodard",
      "image": "assets/vincent.png",
      "text": "Vincent Brodard is a student in computer engineering at the University of Applied Sciences and Arts of Western Switzerland, Fribourg (HES-SO). He holds a Maturité Certificate and he is pursuing his Bachelor studies. He is currently working on a re-educative system for amputees in the IMPACT project in order to create intuitive interfaces for therapists and improve the dynamics of generated body parts in virtual and augmented reality."
    },
    {
      "name": "Quentin Seydoux",
      "image": "assets/quentin.png",
      "text": "Quentin Seydoux is a student in Computer Sciences at the University of Applied Sciences and Arts of Western Switzerland, Fribourg (HES-SO) where he aims to do his Bachelor studies after the HES gateway he is pursuing. He is currently working on the IMPACT project as a trainee. He contributes to develop the user interface and the tracking and animation system in order to help disabled people to have physiotherapy and to re-educate their missing limb using virtual and augmented reality."
    }
  ],
  "partners":[
    {
      "name": "Marie-Laure Kaiser",
      "image": "assets/kaiser.png",
      "text": "Ergothérapeute cheffe du CHUV."
    },
    {
      "name": "Patrick Kabasu Bakajika",
      "image": "assets/patrick.png",
      "text": "Ergothérapeute chef d'unité du DAL. Praticien formateur. Ergothérapeute chef d'unité du DAL Praticien formateur. Département de l'appareil locomoteur. Hôpital Orthopédique - CHUV"
    }
  ],
  "contact":[
    {
      "name": "Francesco Carrino",
      "addresses": {"institute": "HumanTech Institute Ecole d’Ingénieurs et d’Architectes",
                    "street": "Bd de Pérolles 80",
                    "city": "1700 Fribourg",
                    "mail": "francesco.carrino@hefr.ch"},
      "link": "http://humantech.institute/",
      "image": "assets/humantech.png"
    }
  ],
  "acknowledgement":
    {
      "title": "Acknowledgement",
      "text": "This project is supported by",
      "link": "https://www.haslerstiftung.ch/index.php/en/",
      "image": "assets/hasler.png"
    }
}
